// ============================================
// ЗАДАЧА 1: Информация о себе
// ============================================
// Создай константы:
// - имя (String)
// - возраст (Int)
// - рост в метрах (Double, например 1.75)
// - учишься ли сейчас (Bool)
//
// Выведи всё одной строкой с интерполяцией, например:
// "Меня зовут Эмир, мне 20 лет, мой рост 1.80м, учусь: true"

// Твой код:
//let name = "Emi"
//let age = 19
//let height = 1.68
//let isStudying = true
//print("Меня зовут \(name), мне \(age) лет,  мой рост \(height) м, учусь: \(isStudying)")





// ============================================
// ЗАДАЧА 2: Калькулятор BMI (индекс массы тела)
// ============================================
// Формула: BMI = вес / (рост × рост)
//
// Создай переменные:
// - вес в килограммах (Double, например 75.0)
// - рост в метрах (Double, например 1.80)
//
// Посчитай BMI и выведи результат с округлением до 2 знаков
// Подсказка: используй String(format: "%.2f", bmi)
//
// Пример вывода: "Ваш BMI: 23.15"

// Твой код:
//var weight = 53.3
//var height = 1.68  // в метрах!
//var BMI = weight / (height * height)
//print("Ваш BMI: \(String(format: "%.2f", BMI))")






// ============================================
// ЗАДАЧА 3: Конвертер температуры
// ============================================
// Формула: Fahrenheit = Celsius × 9/5 + 32
//
// Создай переменную с температурой в Цельсиях (например 25.0)
// Преобразуй в Фаренгейты
// Выведи оба значения
//
// Пример: "25.0°C = 77.0°F"

// Твой код:
//var cel = 25.0
//var faren = cel * 9/5 + 32
//print("\(cel) = \(faren)")






// ============================================
// ЗАДАЧА 4: Работа со строками
// ============================================
// Создай три константы:
// - город (String)
// - страна (String)
// - континент (String)
//
// Объедини их в формат "Город, Страна, Континент"
// Выведи:
// 1. Получившуюся строку
// 2. Количество символов в строке
// 3. Строку в верхнем регистре
// 4. Строку в нижнем регистре

// Твой код:
//let town: String = "Москва"
//let country: String = "Россия"
//let cont: String = "Европа"
//let a = town + "," + country + "," + cont
//print(a)
//print("\(a.count)")
//print("\(a.uppercased())")
//print("\(a.lowercased())")








// ============================================
// ЗАДАЧА 5: Магазин со скидкой
// ============================================
// Дано:
// - Цена товара: 1299.99
// - Скидка: 15%
//
// Посчитай:
// - Сумму скидки
// - Итоговую цену
// - Сколько экономишь
//
// Выведи красиво, например:
// "Цена: 1299.99₽"
// "Скидка: 15%"
// "Экономия: 195.00₽"
// "К оплате: 1104.99₽"

// Твой код:
//var value = 1299.99
//var pr = 15.0
//var skidka = value / 100 * pr
//print("Цена: \(value)")
//print("Скидка: \(pr)")
//print("Экономия: \(skidka)")
//print("К оплате: \(value - skidka)")



